## sso_proxy
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 3 to add, 2 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.pomerium_sso_proxy will be updated in-place
  ~ resource "aws_ecs_service" "pomerium_sso_proxy" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/pomerium_sso_proxy/pomerium_sso_proxy"
        name                               = "pomerium_sso_proxy"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy:4" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.pomerium_sso_proxy must be replaced
-/+ resource "aws_ecs_task_definition" "pomerium_sso_proxy" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy:4" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  ~ environment      = [
                        # (4 unchanged elements hidden)
                        {
                            name  = "LOG_LEVEL"
                            value = "debug"
                        },
                      ~ {
                            name  = "ROUTES"
                          ~ value = "cm91dGVzOgogIC0gZnJvbTogaHR0cHM6Ly9hdXRoLnNlY3VyaXR5LmNkc3NhbmRib3gueHl6CiAgICB0bzogaHR0cDovL2F1dGguNzk0NzIyMzY1ODA5LmxvY2FsOjgwMDAKICAgIHBvbGljeToKICAgICAgLSBhbGxvdzoKICAgICAgICAgIG9yOgogICAgICAgICAgICAtIGRvbWFpbjoKICAgICAgICAgICAgICAgIGlzOiBzZWN1cml0eS5jZHNzYW5kYm94Lnh5egogICAgY29yc19hbGxvd19wcmVmbGlnaHQ6IHRydWUKICAgIHRpbWVvdXQ6IDMwcwo=" -> "LSBmcm9tOiBodHRwczovL2F1dGguc2VjdXJpdHkuY2Rzc2FuZGJveC54eXoKICB0bzogaHR0cDovL2F1dGguNzk0NzIyMzY1ODA5LmxvY2FsOjgwMDAKICBwb2xpY3k6CiAgICAtIGFsbG93OgogICAgICAgIG9yOgogICAgICAgICAgLSBkb21haW46CiAgICAgICAgICAgICAgaXM6IHNlY3VyaXR5LmNkc3NhbmRib3gueHl6CiAgY29yc19hbGxvd19wcmVmbGlnaHQ6IHRydWUKICB0aW1lb3V0OiAzMHMK"
                        },
                    ]
                  - mountPoints      = [] -> null
                    name             = "pomerium_sso_proxy"
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "pomerium_sso_proxy" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_iam_policy.pomerium_policies must be replaced
-/+ resource "aws_iam_policy" "pomerium_policies" {
      ~ arn       = "arn:aws:iam::794722365809:policy/PomeriumSSOTaskExecutionPolicies" -> (known after apply)
      ~ id        = "arn:aws:iam::794722365809:policy/PomeriumSSOTaskExecutionPolicies" -> (known after apply)
      ~ name      = "PomeriumSSOTaskExecutionPolicies" -> "PomeriumSSOContainerExecutionPolicies" # forces replacement
      ~ policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action   = [
                            "ssm:GetParameters",
                            "ssm:DescribeParameters",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:ssm:ca-central-1:794722365809:parameter/session_key",
                            "arn:aws:ssm:ca-central-1:794722365809:parameter/session_cookie_secret",
                            "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_secret",
                            "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_id",
                            "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_secret",
                            "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_id",
                        ]
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ policy_id = "ANPA3SCJE6FY3TLZU7ISQ" -> (known after apply)
        tags      = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools"
            "Terraform"  = "true"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.pomerium_policies must be replaced
-/+ resource "aws_iam_role_policy_attachment" "pomerium_policies" {
      ~ id         = "pomerium_execution_role-20220422143254115300000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::794722365809:policy/PomeriumSSOTaskExecutionPolicies" -> (known after apply) # forces replacement
      ~ role       = "pomerium_execution_role" -> "container_execution_role" # forces replacement
    }

  # aws_security_group.pomerium will be updated in-place
  ~ resource "aws_security_group" "pomerium" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Access to the internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
            # (1 unchanged element hidden)
        ]
        id                     = "sg-078dc7b81a1f5418d"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Access to load balancer from the internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Access to load balancer"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
            # (1 unchanged element hidden)
        ]
        name                   = "pomerium"
        tags                   = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

17 tests, 17 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
